<template>
  <div style="padding: 0.5em 0.5em 0 0.7em">
      <p>Балльно-рейтинговая система (БРС) определяет три типа дисциплин:
      экзамен, зачёт и дифференцированный зачёт.</p>

      <h4>Зачёты</h4>
      <p>Чтобы получить зачёт, нужно набрать 60 баллов.
      Дифференцированный зачёт — это зачёт с оценкой, который влияет на стипендию.
      Оценка рассчитывается исходя из кол-ва баллов:</p>

      <section class="circles">
        <figure v-for="s in scores">
          <score :mark="s.mark" v-text="s.mark" :small="true"/>
          <figcaption>{{ s.text }}%</figcaption>
        </figure>
      </section>

      <p>Это оценки в системе <a href="https://goo.gl/BrGMQN">ESTC</a>,
      но можно помнить, что в нашем университете 60&nbsp;—&nbsp;это три,
      71&nbsp;—&nbsp;четыре, 85&nbsp;—&nbsp;пять.</p>

      <h4>Экзамены</h4>
      <p>Они как и диф. зачёты влияют на стипендию, но дополнительно содержат мероприятие
      в виде экзамена (устного или письменного) на 40 баллов.</p>

      <p>Чтобы получить допуск к этому мероприятию, нужно набрать 38 баллов.
      На самом же экзамене минимальный проходной балл — 22, так что если вы его
      не набрали, то экзамен не сдан (будет две пересдачи).</p>

      <p>Для тех студентов, кто не хочет сдавать экзамен, есть возможность получить тройку-автомат:
      нужно набрать 60 баллов за семестр и написать заявление в деканате.</p>

      <p>Иногда по дисциплине можно набрать бонусные баллы, они добавляются к итоговому рейтингу
      и <i>не влияют</i> на допуск к экзамену. В графе "экзамен" сайт показывает, что допуска нет.

      <h4>Прочее</h4>
      <p>Полное положение о порядке применения БРС можно найти
      <a href="http://rtf.sfedu.ru/content/pri/pri_248-OD.pdf">здесь</a>.
      Лучше ознакомиться с документом, чтобы избежать злоупотреблений
      со стороны преподавателей. Известны случаи, когда преподаватель:</p>

      <ul>
        <li>проводит зачётное мероприятие (коллоквиум), без которого нельзя
        получить зачёт по дисциплине;</li>

        <li>начисляет штрафные баллы.</li>
      </ul>

      <p>В подобных случаях обращайтесь в студ-совет или деканат.</p>

      <h4>О сайте</h4>
      <p>Сайт научился работать в оффлайне, даже если у вас нет доступа к интернету.
      Ещё браузер предлагает установить сайт на домашний экран как приложение — так можно
      быстрее получить к нему доступ.</p>

      <p>В будущем планируется добавить push-нотификации о новых оценках.
      Если у вас есть ещё какие-то идеи, можете написать
      <a href="https://vk.com/strebz">Игорю</a>. Попробуем реализовать :)</p>

      <p>За тестирование на iOS спасибо <a href="https://vk.com/alexandraolegovna1">Александре</a>.
      Репозиторий проекта: <a href="https://github.com/xamgore/grade-student-profile">github</a>.</p>
  </div>
</template>

<script>
import Score from '../summary/Circle'

export default {
  name: 'Help',
  components: { Score },
  data: () => ({
    scores: [
      { mark: 'FX', text: '38' },
      { mark: 'E', text: '60' },
      { mark: 'D', text: '65' },
      { mark: 'C', text: '71' },
      { mark: 'B', text: '85' },
      { mark: 'A', text: '95' }
    ]
  })
}
</script>

<style scoped>
  p {
    margin-top: 0.3em
  }

  h4 {
    margin-bottom: 0
  }

  .circles {
    display: flex;
    justify-content: space-around;
    flex-wrap: wrap;
    margin-bottom: 0.7em;
  }

  figure {
    display: flex;
    flex-direction: column;
    align-items: center;
    margin: 0;
  }

  figcaption {
    text-align: center;
    margin-top: 0.2em;
    font-size: 0.9em;
  }

  a {
    color: #2196f3;
  }

  ul {
    margin: -0.6em 0em 0.6em;
    padding-left: 2.5em;
  }
</style>
